tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed, offline-first bug tracker embedded in git, with bridges
brew "git-bug"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go programming environment (1.17)
brew "go@1.17"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.18"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Postgres C API library
brew "libpq", link: true
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Android SDK component
cask "android-platform-tools"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Reimagine your terminal
cask "fig"
# Utility to hide menu bar items
cask "hiddenbar"
# Clipboard manager
cask "jumpcut"
# System monitor for the menu bar
cask "stats"
# Real time file synchronization software
cask "syncthing"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
